read_verilog counters/counter_32_for_synth.v
read_verilog -lib libs/cmos_cells_delay.v


proc; memory; opt; techmap; opt;

dfflibmap -liberty libs/cmos_cells.lib
abc -liberty libs/cmos_cells.lib;;

write_verilog synth.v