read_verilog buffer_wrapper.v
read_verilog -lib ../yosys_libs/cmos_cells.v

proc;; memory;; techmap;;

dfflibmap -liberty ../yosys_libs/cmos_cells.lib
abc -liberty ../yosys_libs/cmos_cells.lib;;

write_verilog yosys/synth_buffer.v
