read_verilog modules/fetch.v
read_verilog -lib ../yosys_libs/cmos_cells.v


proc; memory; opt; techmap; opt;

dfflibmap -liberty ../yosys_libs/cmos_cells.lib
#abc -liberty ../yosys_libs/cmos_cells.lib;;

write_verilog yosys/synth_fetch.v